# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Phundrak’s polybar config
#+INCLUDE: headers.org
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's polybar config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's polybar config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the polybar config file of Phundrak" />
#+PROPERTY: header-args :exports none
#+PROPERTY: header-args:python :results output
#+PROPERTY: header-args:conf-windows :tangle ~/.config/polybar/config :noweb yes :exports code

*** Fonts and locale
    :PROPERTIES:
    :CUSTOM_ID: h-c5660945-4785-40f7-b89e-f9f31b85a062
    :END:
    Now we can  chose which font fill be  used in order to display  text in this
    bar, as well as the locale we want. The locale will be useful for displaying
    information such as  date and time, which  is a module we will  have in this
    top bar. First, the declaration of the locale is done like so:
    #+NAME: locale-bar
    #+BEGIN_SRC conf-windows
      locale = ja_JP.UTF-8
    #+END_SRC

    Now, we can declare  the fonts we want to use in Polybar.  It is possible to
    declare several of  them, the first one  is the one which  gets the absolute
    priority, and  the next ones  with a larger  index are fallback  fonts. Font
    declaration accepts the fontconfig format  as well as possible offset[fn:1].
    Five fonts are used in my polybar config:
    #+NAME: fonts-polybar
    | Font         | fontconfig                                         | Vertical offset | Why it’s used         |
    |--------------+----------------------------------------------------+-----------------+-----------------------|
    | Fira Sans    | Fira Sans Book:style=Book:pixelsize=10             |               1 | Text display          |
    | IPA Mincho   | IPAMincho:style=regular:pixelsize=6                |               0 | Japanese text display |
    | Unifont      | unifont:fontformat=truetype:size=6:antialias=false |               0 | Fallback font         |
    | NotoEmoji    | NotoEmoji:style=Book:scale=16                      |               0 | Emoji display         |
    | Siji         | Siji:pixelsize=8                                   |               0 | Symbol display        |
    | Default font | fixed:pixelsize=8                                  |               0 | Fallback font         |

    #+NAME: font-config
    #+BEGIN_SRC python :var table=fonts-polybar :cache yes
      for i in range(0, len(table)):
          print("font-{0} = {1};{2}".format(i, table[i][1], table[i][2]))
    #+END_SRC

    #+RESULTS[a055f871fdabec995b015a8f083a77b0096a9c7f]: font-config
    : font-0 = Fira Sans Book:style=Book:pixelsize=10;1
    : font-1 = IPAMincho:style=regular:pixelsize=6;0
    : font-2 = unifont:fontformat=truetype:size=6:antialias=false;0
    : font-3 = NotoEmoji:scale=12:style=Book;0
    : font-4 = Siji:pixelsize=8;0
    : font-5 = fixed:pixelsize=8;0

    Here’s the font configuration:
    #+BEGIN_SRC conf-windows
      <<font-config()>>
    #+END_SRC

    Note that only Fira Sans get a small  offset due to the size of the font and
    the height of the bar itself.

**** Workspace icons
     :PROPERTIES:
     :CUSTOM_ID: h-300a226b-1b3e-49aa-93c2-325ee26e8e1f
     :END:
     Now, let’s name our workspaces. We can give them whatever name we want them
     to have, but I just like the aesthetics of Japanese characters, so let’s go
     with the kanji equivalent of the number of the workspaces.
     #+NAME: ws-names
     | workspace number | name |
     |------------------+------|
     |                1 | 一   |
     |                2 | 二   |
     |                3 | 三   |
     |                4 | 四   |
     |                5 | 五   |
     |                6 | 六   |
     |                7 | 七   |
     |                8 | 八   |
     |                9 | 九   |
     |                0 | 十   |

     #+NAME: generate-ws-names
     #+BEGIN_SRC python :var names=ws-names :exports none :cache yes
       for i in range(0, len(names)):
           print('ws-icon-{0} = {1};{2}'.format(i, names[i][0], names[i][1]))
     #+END_SRC

     #+RESULTS[e4cec50affbfc3c284504f1a0f3b6a8d78197c5d]: generate-ws-names
     #+begin_example
     ws-icon-0 = 1;一
     ws-icon-1 = 2;二
     ws-icon-2 = 3;三
     ws-icon-3 = 4;四
     ws-icon-4 = 5;五
     ws-icon-5 = 6;六
     ws-icon-6 = 7;七
     ws-icon-7 = 8;八
     ws-icon-8 = 9;九
     ws-icon-9 = 0;十
     #+end_example

     Here are the corresponding configuration lines:
     #+BEGIN_SRC conf-windows
     <<generate-ws-names()>>
     #+END_SRC

     In case we create a workspace which isn’t  named from ~0~ to ~9~, I want it
     to appear as is.
     #+begin_src conf-windows
       ws-icon-default = %index%
     #+end_src

